import { CSV } from "https://js.sabae.cc/CSV.js";

export const makeVoice1 = async () => {
  const dataall = await CSV.fetchJSON("R5sisei_kekka.csv")

  // No,紙/WEB,問1,問2,問3,問3 その他,問4,問5,問6,問7 1つ目,問7 2つ目,問7 3つ目,問7 その他,問8 1人目,問8 2人目,問8 3人目,問8 4人目,問8 5人目,問8 未就学児,問8 小学生,問8 中学生,問8 高校生,問8 大学生等,問9,問10,問10 その他,問11 1つ目,問11 2つ目,問11 3つ目,問11 その他,問12 1つ目,問12 2つ目,問12 3つ目,問12 その他,問13① 1つ目,問13① 2つ目,問13① 3つ目,問13① その他,問13② 1つ目,問13② 2つ目,問13② 3つ目,問13② その他,問13③ 1つ目,問13③ 2つ目,問13③ 3つ目,問13③ その他,問13④ 1つ目,問13④ 2つ目,問13④ 3つ目,問13④ その他,問13⑤ 1つ目,問13⑤ 2つ目,問13⑤ 3つ目,問13⑤ その他,問13市 1つ目,問13市 2つ目,問13市 3つ目,問13市 その他,問14,問15-1 1-1重,問15-1 1-1満,問15-1 1-2重,問15-1 1-2満,問15-1 1-3重,問15-1 1-3満,問15-1 1-4重,問15-1 1-4満,問15-1 1-5重,問15-1 1-5満,問15-1 1-6重,問15-1 1-6満,問15-1 1-7重,問15-1 1-7満,問15-1 1-8重,問15-1 1-8満,問15-1 1-9重,問15-1 1-9満,問15-1 2-1重,問15-1 2-1満,問15-1 2-2重,問15-1 2-2満,問15-1 2-3重,問15-1 2-3満,問15-1 2-4重,問15-1 2-4満,問15-1 2-5重,問15-1 2-5満,問15-1 2-6重,問15-1 2-6満,問15-1 2-7重,問15-1 2-7満,問15-1 2-8重,問15-1 2-8満,問15-1 2-9重,問15-1 2-9満,問15-1 2-10重,問15-1 2-10満,問15-1 2-11重,問15-1 2-11満,問15-1 2-12重,問15-1 2-12満,問15-1 2-13重,問15-1 2-13満,問15-1 2-14重,問15-1 2-14満,問15-1 2-15重,問15-1 2-15満,問15-1 2-16重,問15-1 2-16満,問15-1 2-17重,問15-1 2-17満,問15-1 2-18重,問15-1 2-18満,問15-1 2-19重,問15-1 2-19満,問15-1 2-20重,問15-1 2-20満,問15-1 2-21重,問15-1 2-21満,問15-1 2-22重,問15-1 2-22満,問15-2 ①1つ目,問15-2 ①2つ目,問15-2 ①3つ目,問15-2 ②1つ目,問15-2 ②2つ目,問15-2 ②3つ目,問16 1重,問16 1満,問16 2重,問16 2満,問16 3重,問16 3満,問16 4重,問16 4満,問16 5重,問16 5満,問16 6重,問16 6満,問16 7重,問16 7満,問16 8重,問16 8満,問16 9重,問16 9満,問16 10重,問16 10満,問16 11重,問16 11満,問16 12重,問16 12満,問16 13重,問16 13満,問16 14重,問16 14満,問16 15重,問16 15満,問16 16重,問16 16満,問16 17重,問16 17満,問16 18重,問16 18満,問17 自由 意見,web回答番号
  const convert = (d) => {
    const map = {
      "問1": {
        1: "男性",
        2: "女性",
        3: "回答しない",
        99: "無回答",
      },
      "問2": {
        1: "16～17歳",
        2: "18～21歳",
        3: "22～29歳",
        4: "30～39歳",
        5: "40～49歳",
        6: "50～59歳",
        7: "60～64歳",
        8: "65～69歳",
        9: "70～74歳",
        10: "75歳以上",
        99: "無回答",
      },
      "問9": {
        0: "分からない",
        1: "とても不幸",
        2: "不幸",
        3: "普通",
        4: "幸せ",
        5: "とても幸せ",
        99: "無回答",
      },
      "問14": {
        1: "はい",
        2: "いいえ",
        99: "無回答",
      },
    }
    for (const name in d) {
      const c = map[name];
      if (c) {
        d[name] = c[d[name]];
      }
    }
  };
  dataall.forEach(convert);

  const data = dataall.filter(d => d["問17 自由 意見"]).map(d => {
    return {
      voice: d["問17 自由 意見"],
      age: d["問2"],
      sex: d["問1"],
      happiness: d["問9"],
    };
  });
  //console.log(data);
  return data;
};
